Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་གྲོལ་ཕྱག་རྒྱས་དོགས་མེད་པར། །སངས་རྒྱས་མཚུངས་མེད་འགྱུར་བ་ཡིན།
en: With this mudrā of liberation he will certainly obtain unsurpassable buddhahood.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་གྱིས་ནི། །ཕྱག་བྱས་པ་ཡི་ཕྱག་རྒྱ་འདི། །རྣམ་གྲོལ་དཀྱིལ་འཁོར་རྨད་དུ་བྱུང་།
en: This mudrā is revered by all bodhisattvas as a wondrous maṇḍala of liberation.

source: །ཨོཾ་པདྨེ་སུང་པདྨེ་བི་མོ་ཀྵ་མཎྜ་ལ།
en: The mantra to accompany this mudrā is: [250] “Oṁ, lotus, auspicious lotus!

source: པདྨ་བྷུ་ཛེ་སྭཱ་ཧཱ།
en: O lotus-armed maṇḍala of liberation, svāhā! “

source: རྡོ་རྗེ་བཅིང་བ་མཉམ་གཞག་སྟེ། །རྡོ་རྗེ་པདྨོ་གུང་མོ་ནི།
en: Having formed the shape of the lotus, the vidyā holder should fold the middle fingers to form a vajra lotus.

source: །བསྐུམས་ན་དེ་བཞིན་གཤེགས་ཀུན་གྱི། །རྣམ་གྲོལ་གསུང་བའི་ཕྱག་རྒྱ་འདི། །ཡང་དག་གྲོལ་བར་རབ་ཏུ་བསྟན།
en: This is the mudrā of all tathāgatas, the secret mudrā of liberation that shows the nature of liberation.

source: །ཕྱག་རྒྱ་འདི་ནི་བསྟན་པས་ནི། །ངན་པར་བྱས་པ་ཐམས་ཅད་འཇིག །
en: All evil actions are purified when this mudrā is displayed.

source: ཨོཾ་ཨ་མོ་གྷ་བཛྲ་པདྨ་བྷུ་ཛེ་མི་ལི་མི་ལི་སྭཱ་ཧཱ།
en: The mantra to accompany this mudrā is: [251] “Oṁ, Amogha, you hold the vajra and the lotus in your hands, mili mili!

source: ལག་གཉིས་ཐལ་མོ་ཁོང་སྟོང་ལས།
en: Svāhā! “

source: །མདོར་ན་ནོར་བུ་འདྲ་བར་བཅིང་།
en: The vidyā holder should join his cupped hands to form a jewel-like enclosure.

source: །ནོར་བུའི་ཕྱག་རྒྱ་རྡོ་རྗེ་འདྲ། །ཡིད་བཞིན་ནོར་བུར་བརྗོད་པ་ཡིན།
en: This is how the mudrā of the wish-fulfilling jewel is formed, a gem that has the shape of a vajra.

source: །ལས་ནི་དོན་ཡོད་ཐམས་ཅད་བྱེད། །དོན་ཡོད་མཆོད་པའི་ཆར་འབེབས་ཤིང་།
en: It turns any activity into an amogha activity and produces a rain of amogha offerings.

source: །དོན་ཡོད་ཕ་རོལ་ཕྱིན་དྲུག་རྫོགས། །དོན་ཡོད་སངས་རྒྱས་རྣམས་དང་ནི། །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་ཡིན།
en: It amogha-fulfills the six perfections and amogha-allows the vidyā holder to see buddhas and the bodhisattvas.

source: །དོན་ཡོད་རྣམ་གྲོལ་དཀྱིལ་འཁོར་གསང་། །མཚམས་མེད་ལྔ་པོ་སྦྱོང་བར་མཛད།
en: This mudrā is the secret amogha maṇḍala of liberation that purifies even the five acts of immediate retribution.

source: །ཨོཾ་ཨ་མོ་གྷ་མ་ཎི་མ་ཎི།
en: The mantra to accompany this mudrā is: [252] “Oṁ, amogha jewel, jewel!

source: མ་ཧཱ་མ་ཎི་པདྨ་མ་ཎི་སྭཱ་ཧཱ།
en: The great jewel! The lotus jewel! Svāhā! “

source: རྡོ་རྗེ་པདྨའི་ཐལ་མོ་སྦྱར།
en: The vidyā holder should join his hands in an añjali gesture shaped like the vajra lotus.

source: །པདྨ་ཁ་བྱེ་འདྲ་བར་རྒྱས།
en: It should be a lotus in full bloom and be skillfully formed.

source: །གུང་མོ་ལྕགས་ཀྱུ་འདྲ་བ་ཡི། །ཕྱག་རྒྱ་འདི་ནི་མཆོག་ཏུ་བཟང་། །ཕྱག་རྒྱ་འདི་ནི་མཐོང་ཙམ་གྱིས།
en: This mudrā, with the middle fingers forming the shape of a hook, is supremely auspicious.

source: །འབྲས་བུ་ཆེན་པོ་རྨད་དུ་བྱུང་།
en: It is capable of producing great and marvelous results when displayed.

source: །འཇིག་རྟེན་འདས་པ་ཁྱད་པར་འཕགས། །དུས་གསུམ་སངས་རྒྱས་མཐོང་བ་ཡིན།
en: It is distinguished as a supramundane mudrā that allows the vidyā holder to see the buddhas of the three times.

source: བཛྲེ་མ་ཧཱ་པདྨེ།
en: Great lotus!

source: ཛ་ལེ་སུ་ཛ་ལེ་ལ་མ་ཧཱ་ཛ་ལེ་སྭཱ་ཧཱ།
en: Añjali, jali, auspicious jali, the great jali,svāhā! “

source: སྙིང་གར་རྡོ་རྗེ་པདྨ་ཉིད། །རྡོ་རྗེ་བཅིང་བ་ཕུན་སུམ་ཚོགས། །མཛུབ་མོ་ལྕགས་ཀྱུ་འདྲ་བ་ནི། །བཅིང་བར་བྱ་བ་ཕྱག་རྒྱ་འདི།
en: The vidyā holder should display the vajra-lotus mudrā at his heart and press on his index fingers with the hook-shaped middle fingers, thus forming the vajra tip.

source: །གཟི་བརྗིད་ཆེན་པོ་དག་དང་ནི། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་པ་དང་།
en: This mudrā produces a great amount of vital energy and brings great strength and valor.

source: །ཐམས་ཅད་གྲུབ་པར་བྱེད་པའི་གནས། །ཐམས་ཅད་གྲུབ་པར་རབ་ཏུ་སྦྱིན། །འཇིག་རྟེན་འདས་པ་གྲུབ་པ་ཆེ། །སངས་རྒྱས་ཉིད་ཕྱིར་བླ་ན་མེད།
en: It is the seat of every accomplishment, grants every accomplishment, and leads to the great accomplishment that is beyond this world: unsurpassable buddhahood.

source: །སྡིག་པ་ཐམས་ཅད་འཕྲོག་པ་གྲུབ།
en: It is unsurpassed when it comes to successfully removing everything that is evil.

source: །གསང་སྔགས་གྲུབ་པ་བླ་ན་མེད། །ཨོཾ་ཨ་མོ་གྷ་སིད་དྷི།
en: The mantra to accompany this mudrā is: [254] “Oṁ, you possess amogha accomplishment, the accomplishment of every tathāgata!

source: སརྦ་ཏ་ཐཱ་ག་ཏ་སིད་དྷི།
en: Look on with compassion, O accomplished being!

source: ཨ་བ་ལོ་ཀཱ་ཡ་སིད་དྷི།
en: Your accomplishment is great and profound!

source: །མ་ཧཱ་བི་བུ་ལ་སིད་དྷི།
en: Act, act!

source: རྡོ་རྗེ་ཐལ་མོ་མཉམ་བཞག་སྟེ། །གུང་མོ་གཤིབས་ཏེ་བསྒྲེང་བ་དང་།
en: The vidyā holder should form the lotus añjali-gesture, with the middle fingers raised up to the same level.

source: །སྲིན་ལག་མཐེ་བོ་སོ་སོར་འགྱེད། །གུང་མོ་ཡིད་ཙམ་དགུག་ཕྱ་བ།
en: The little fingers and the thumbs should held be apart, with only the middle fingers folded in.

source: །པདྨའི་དབང་ཕྱུག་སེམས་དཔའ་ཆེ། །འཇིག་རྟེན་དབང་ཕྱུག་བླ་མ་སྟེ།
en: This mudrā stands for the lotus lord, the great being and lokeśvara-teacher.

source: །རྟག་ཏུ་རྣམ་གྲོལ་དཀྱིལ་འཁོར་ནི། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས། །ཕྱག་རྒྱ་བྱས་པ་འདི་ཡིན་ནོ།
en: It constitutes a maṇḍala of liberation that is always revered by all bodhisattvas.

source: །ཕྱག་རྒྱ་འདི་དང་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་ཕྱག་རྒྱ་དང་།
en: This mudrā is the heart mudrā of Amoghapāśa.

source: ཕྱག་རྒྱ་དེ་དག་མཐོང་བ་ནི་འཇིག་རྟེན་དབང་ཕྱུག་མཐོང་བ་དང་འདྲ་བ་ཡིན་ནོ།
en: Seeing this mudrā is the same as seeing the Lokeśvara himself.

source: །ཕྱག་རྒྱ་མཆོག་འདི་མཐོང་བ་ནི་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་མཐོང་བ་དང་འདྲ་བ་ཡིན་ཏེ།
en: Seeing this supreme mudrā is the same as seeing a maṇḍala of liberation.

source: ཕྱིར་མི་ལྡོག་པ་ཐོབ་པར་འགྱུར་རོ།
en: Anyone who displays it will be irreversibly established on the path to awakening.

source: །ཕྱག་རྒྱ་འདི་བཅིངས་པ་ཙམ་མཐོང་བའི་མོད་ལ་དམ་ཚིག་ཐམས་ཅད་ཤེས་པར་འགྱུར་རོ།
en: By seeing this mudrā displayed, one will come to understand all samayas as soon as one sees it.

source: །མཐོང་བ་དང་གཟུང་བ་ཙམ་གྱི་མོད་ལ་འབྲས་བུ་ཆེན་པོ་འཐོབ་ཅིང་མོད་ལ་སངས་རྒྱས་དང་བྱང་ཆུབ་བླ་ན་མེད་པ་ཡིན་ནོ།
en: Great results can be instantaneously obtained by merely seeing or forming this mudrā, including the unsurpassable awakening of a buddha.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ། །ཨོཾ་ཨ་བ་ལོ་ཀི་ཏ་མ་ཧཱ་ཤུད་དྷ་ས་ཏྭ་ས་ར་ས་ར། ས་མནྟ། ཨ་བ་བྷཱ་ས། ཀུཎྜ་ལ།
en: Homage to the noble bodhisattva Avalokiteśvara, the most compassionate, great being!

source: དྷ་ལ།
en: The mantra to repeat is: [255] “Oṁ, great, pure being with a compassionate gaze!

source: མ་ཀུ་ཊ་དྷ་ར།
en: You wear earrings that radiate light everywhere. Your crown jewel is Amitābha, and your topknot is adorned with the crescent of the vajra moon.

source: ན་བ་བཛྲེནྡྲ།
en: Please help to accumulate provisions, O being with the lotus of the lord of the worlds in your hand!

source: མཎྜི་ཏ། ཙ་ར་ཙ་ར། སམྦྷ་ར།
en: Svāhā! “

source: བྷུ་བ་ནེ་ཤྭ་ར་པདྨ་བྷུ་ཛེ་སྭཱ་ཧཱ། ཕྱག་རྒྱ་ཆེན་པོ་བདུན་པོ་དེ་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་བྱང་ཆུབ་སྙིང་པོའི་ལམ་གྱི་འབྲས་བུ་སྟོན་པ།
en: These seven mudrās reveal the fruits that are beyond this world. They show the path that leads to the seat of awakening and sets in motion the wheel of Dharma.

source: རྟག་ཏུ་འཇིག་རྟེན་དབང་ཕྱུག་བླ་མ།
en: They are the dwelling place of the Lord of the World. They are lokeśvara-teachers.

source: འཇིག་རྟེན་མགོན་པོའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཡིན་ནོ། །ཕྱག་རྒྱ་བདུན་ནི་ཕྱག་རྒྱ་ཆེན་པོ་བྱེ་བ་ཕྲག་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཡིན་ཏེ།
en: These seven mudrās are each surrounded by seven times ten million great mudrās.

source: ཕྱག་རྒྱ་ཆེན་པོ་བདུན་པོ་དེ་གང་དུ་བཅིངས་ཤིང་ཕྱག་རྒྱ་མཆོག་གཟུང་བ་ནི་ཕྱག་རྒྱ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་བཅིངས་བར་འགྱུར་རོ།
en: Wherever these seven mudrās are displayed and perceived, seven times ten million great mudrās are displayed and perceived.

source: །གཟུང་བར་འགྱུར་རོ། །དེ་དག་ཐམས་ཅད་མཆོད་པ་དང་། བསྙེན་བཀུར་བྱས་པར་འགྱུར་རོ། །བསྟོད་པར་འགྱུར་རོ།
en: They are all worshiped, honored, and revered.

source: །མིང་འཛིན་པ་བྱས་པར་འགྱུར་རོ།
en: Their names are understood and remembered.

source: །ཕྱག་རྒྱ་བདུན་པོ་དེ་དག་ནི་གསང་སྔགས་སྒྲུབ་པ་ཐམས་ཅད་དང་།
en: These seven great mudrās render the mantras efficacious in every respect.

source: ཀུན་དུ་ལས་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ།
en: They can be employed in any activity, and they will accomplish anything.

source: །ལས་ཐམས་ཅད་བྱེད་པའི་ཕྱག་རྒྱ་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་བླ་ན་མེད་པ་ཡིན་ནོ།
en: They constitute the supreme path that leads beyond this world. “

source: །གང་ཞིག་ཕྱག་རྒྱ་དེ་དག་བཅིངས་པ་མཐོང་ཞིང་ཁྲུས་ལེགས་པར་བྱས་ཏེ། གཙང་མས་སྒྲུབ་པར་བྱེད་པ་འདི་ནི་ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར། སྔོན་གྱི་སྒྲིབ་པས་དམྱལ་བ་མཐོང་བར་མི་འགྱུར།
en: The practitioner who forms and displays these mudrās while ritually pure and thoroughly bathed will not experience hell or other unhappy destinies.

source: །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱི་མོད་ལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བདུན་གྱི་དྲུང་དུ་དགེ་བའི་རྩ་བ་བསགས་པར་འགྱུར་རོ།
en: His previous obscurations will be instantaneously purified. As soon as he displays these mudrās, he plants the same roots of virtue as he would if he were in the presence of seven times one hundred thousand million billion perfectly realized buddhas.

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཀུན་དུ་གཟུང་བར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: He will accumulate a tremendous amount of merit and will fully master the six perfections.

source: །ས་བཅུ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ། །ཕྱིར་མི་ལྡོག་པའི་གནས་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ།
en: He will be established on the tenth bodhisattva level and will not be liable to turn back.

source: །མཚམས་མེད་པ་ལྔ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་བ་འདེབས་པ་དང་། མནར་མེད་པ་ལ་གཞོལ་བ་རྣམས་ཀྱིས་ཇི་སྟེ་ཕྱག་རྒྱ་གཟུང་བ་ཙམ་དང་། བསྟན་པ་ཙམ་གྱི་མོད་ལ་སྡིག་པ་དེ་དག་ཐམས་ཅད་རྣམ་པར་ཞིག་པར་འགྱུར་རོ།
en: Even if he were bound for the Avīci hell after committing the five acts of immediate retribution, opposing the true Dharma, or slandering the noble ones, all these evil acts will be instantly purified as soon as he forms and displays these seven mudrās. “

source: །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་ལ་སོགས་པ་རྣམས་ལས་ལེགས་པར་བསྲུངས་པར་འགྱུར་རོ། །དབང་ཕྱུག་དང་དབང་ཕྱུག་ཆེན་པོ་དང་།
en: All buddhas and bodhisattvas will treat him kindly, and he will be well protected by the devas, nāgas, yakṣas, rākṣasas, bhūtas, and piśācas.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་དང་། གཞོན་ནུ་རྣམས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྲུང་བ་དང་།
en: Īśvara, Maheśvara, the Four Great Kings, Yama, Varuṇa, Kubera, and Kumāra will be his constant companions and will stand by in order to guard, protect, and defend him.

source: བསྐྱབ་པ་དང་། སྦ་བའི་ཕྱིར་རྒྱུན་དུ་རྗེས་སུ་འབྲང་བ་བྱེད་པར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་དགའ་བ་མཐོང་བར་འགྱུར་རོ།
en: Everyone will be delighted to see him.

source: །མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་པར་འདོད་པ་དང་། ལུས་རིང་བསྲེལ་གྱི་སྙིང་པོ་ཡིན་པར་འགྱུར་རོ། །རྡོ་རྗེ་ལྟར་མཁྲེགས་པའི་ལུས་སུ་འགྱུར་རོ། །དུག་གིས་མི་ཚུགས། མེས་མ་ཡིན།
en: His body will become like a caitya containing holy relics and will be as impregnable as a diamond.

source: མཚོན་གྱིས་མ་ཡིན། ཆུས་མ་ཡིན། དབྱིག་དུག་གི་འཇིགས་པས་མ་ཡིན། སེང་གེས་མ་ཡིན། གཅན་གཟན་གཏུམ་པོས་མ་ཡིན། དུག་མི་བཟད་པས་མ་ཡིན།
en: No poison, fire, water, weapons, hail, rats, lions, wild animals, āśīviṣa snakes, thieves, or bandits will present any danger to him.

source: རྐུན་པོ་དང་། མི་རྒོད་ཀྱིས་མ་ཡིན། ཁྱིམ་རྡིབ་པས་མ་ཡིན། གནོད་སྦྱིན་དང་། སྲིན་པོའི་གདོན་ཡང་འོང་བར་མི་འགྱུར་རོ།
en: He will not be driven out of his home, and he will no longer be troubled by yakṣas, rākṣasas, or grahas.

source: །ནད་ཐམས་ཅད་འཇུག་པར་མི་འགྱུར། ལུས་ལ་དུག་སྦྱར་མ་དང་། བྱད་དང་སྦོད་གཏོང་གི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །རྟག་ཏུ་སྡིག་པ་ཅན་གྱི་རྨི་ལམ་མཐོང་བར་མི་འགྱུར་རོ།
en: He will be immune to all diseases; no venoms, kākhordas, or kiraṇas will ever harm his body, and he will never have nightmares. “

source: །རྟག་ཏུ་དེ་བཞིན་གཤེགས་པ་ལྟ་བ་མཐོང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་ལྟ་བ་མཐོང་བར་འགྱུར་རོ། །རྟག་ཏུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཐོང་སྟེ། རྟག་ཏུ་མཆོག་སྦྱིན་པ་མཛད་པར་འགྱུར་རོ། །ལྷ་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་འདིས་མཐོང་བར་དགྱེས་པར་འགྱུར་རོ།
en: He will always see and receive boons from the tathāgatas, bodhisattvas, and Noble Avalokiteśvara, and the gods will always want to see him.

source: །རྟག་ཏུ་ཡོན་ཏན་དང་བསོད་ནམས་འབར་རོ། །དཔལ་གྱིས་ལུས་ལ་ཤིན་ཏུ་འབར་བའི་ལུས་སུ་འགྱུར་རོ། །ཐམས་ཅད་དུ་འདི་མཆོད་པར་འོས་པ་ཆེན་པོར་འགྱུར་ཏེ།
en: His qualities and merit will continuously shine forth, so that his body is resplendent and glows with light.

source: རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། བཙུན་མོའི་འཁོར་གྱིས་མཆོད་པར་འོས་པ་ཆེན་པོར་འགྱུར་རོ།
en: Everywhere he goes he will be honored with great offerings, including offerings from the king and his ministers, chamberlains, harem, and retinue.

source: །ལྷའི་གནས་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་བར་དུ་ཡང་དགྱེས་པར་འགྱུར་ཏེ། མཆོད་པར་བྱེད་དོ། །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལྷའི་བདག་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་།
en: Even the devas, as far as the thirty-two abodes, will worship him with delight.

source: གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། གཞོན་ནུ་དང་། དྲང་སྲོང་གི་ཚོགས་རྣམས་ཀྱིས་མཆོད་པར་འོས་པ་ཆེན་པོར་འགྱུར་རོ།
en: He will be honored with great offerings by Śakra, the chief god-king of the thirty gods, and by Brahmā, Viṣṇu, Maheśvara, Yama, Varuṇa, Kubera, Kumāra, and the hosts of ṛṣis.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་རྟག་ཏུ་དེ་མཐོང་བར་འདོད་པར་འགྱུར་རོ། །རྟག་ཏུ་དགྱེས་པར་སྟོན་པ་བཞེད་པར་འགྱུར་རོ།
en: All beings will constantly desire to see him; they will take pleasure in seeing him and will always wish for it. “

source: །རིག་སྔགས་འཆང་བས་ཁྲུས་བྱས་གོས་གཙང་མ་བགོས་ཏེ་གཙང་མར་བྱས་ལ་དྲི་སྣ་ཚོགས་ཀྱིས་ལུས་བསྐུ་བ་དང་།
en: To display these mudrās, the vidyā holder should purify himself ritually, bathe thoroughly, and put on clean clothes.

source: བདུག་པ་སྣ་ཚོགས་ཀྱིས་བདུག་པ་བྱས་ལ། ཙནྡན་དཀར་པོ་དང་། གུར་གུམ་གྱིས་ལག་པ་གཉིས་བསྐུས་ཏེ། ག་པུར་དང་།
en: He should anoint his body with various fragrances, fumigate it with various types of incense, and smear his arms with white sandalwood and saffron.

source: གླ་རྩིས་བསྒོས་པའི་ས་ཕྱོགས་གཙང་མར་རས་ཀྱི་སྐུ་གཟུགས་ཀྱི་སྤྱན་སྔ་འམ།
en: Ritually pure and perfumed with camphor and musk, he should sit cross-legged on a clean patch of ground.

source: སངས་རྒྱས་ཀྱི་སྐུ་གཟུགས་ཀྱི་སྤྱན་སྔའམ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྐུ་གཟུགས་ཀྱི་སྤྱན་སྔར་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ནས་ཕྱག་རྒྱ་འདི་བཅིང་བར་བྱའོ།
en: He should display the mudrās in front of either a cloth painting or a figure of the Buddha.

source: །མཆོད་རྟེན་རིང་བསྲེལ་ཅན་གྱི་དྲུང་དུ་ཕྱག་རྒྱ་བཅིང་བར་བྱའོ།
en: He can also display them in front of Noble Avalokiteśvara or a caitya containing relics.

source: །སངས་རྒྱས་ལ་མཆོད་པའི་ཚོགས་ཡོན་ཆབ་ལ་སོགས་པ་དབུལ་བར་བྱའོ། །བྱམས་པ་དང་སྙིང་རྗེའི་སེམས་སུ་བྱའོ།
en: Following the procedure of making offerings to the Buddha, he should offer argha water for the feet and generate thoughts of love and compassion.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ལྷག་པར་བརྩེ་བ་དང་། སྙིང་རྗེའི་སེམས་བསྒོམ་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་དང་འདྲ་བར་ཤེས་པར་བྱའོ།
en: With his heart overflowing with great compassion, he should be motivated wholly by pity for all sentient beings, regarding each of them as his one and only child.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཡིད་ལ་དྲན་པར་བྱའོ། །སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་དྲན་པ་བསྒོམ་པར་བྱ་སྟེ།
en: He should contemplate Noble Avalokiteśvara and the Buddha and maintain mindfulness of them.

source: ཕྱག་རྒྱ་ཆེན་པོ་བདུན་པོ་དེ་དག་བཅིང་བ་བྱས་ན་ཕྱག་རྒྱ་བྱེ་བ་ཕྲག་བདུན་བཅིངས་པར་འགྱུར་རོ།
en: By displaying these seven mudrās, he will in effect display seven times ten million. “

source: །དེ་ནས་མཐུ་བརྗོད་པར་བྱའོ། །མཐུ་ནི་འཇིག་རྟེན་ལས་འདས་པ་ཡང་དག་པར་མཐོང་བ་དང་། དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་འཕྲུལ་དང་། རང་བཞིན་གྱི་སྐུ་མངོན་དུ་མཐོང་བ་ཡིན་ནོ། །རྒྱལ་པོའམ།
en: I will now teach the rite of communion whereby the reality of the lives to come is revealed and the magical activity of Amoghapāśa can be plainly seen.

source: བཙུན་མོའི་ནང་དུའམ། སྐྱེ་བོ་མང་པོའི་ནང་དུ་ཚོགས་པ་དང་། དགེ་སློང་གི་ཚོགས་ཀྱི་དགེ་འདུན་གྱི་ནང་དུའམ། འཁོར་དུ་བཅད་པའི་ནང་དུའམ། རིག་བྱེད་བཞི་ཚོགས་པ་དང་། དགེ་སྦྱོང་དང་། བྲ
en: This rite reveals the true state of one’s body and mind, and it will instantly demonstrate the miraculous power of Amoghapāśa whether it is performed in front of a king, in the midst of his harem, or in a great crowd or a great assembly, a congregation of monks, a group of people, a society of scholars versed in the four modes of knowledge, a gathering of ascetics or brahmins or kṣatriyas—be they women, men, boys, or girls—or a gathering of vaiśyas or śūdras. “

source: མ་ཟེ་དང་། རྒྱལ་རིགས་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་བཅས་པ་དེ་དག་གི་ནང་དུ་དེ་དག་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་འཕྲུལ་འཇིག་རྟེན་ལས་འདས་པ་མོད་ལ་མངོན་དུ་མཐོང་བ་དང་། འདས་པའམ། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་འཆི་བ་དང་། སྐྱེ་བ་དང་། སྐྱེས་ནས་ཡང་དག་པར་དགེ་བ་དང་། མི་དགེ་བའི་འབྲས་བུ་དང་། དགེ་བ་དང་མི་དགེ་བས་ཤི་བ་དང་།
en: They will see, before their very eyes, their deaths and births beyond their current life—those of the past, present, and future—as well as their good and bad karma and its fruits.

source: སྐྱེས་ནས་ཕྱུག་པོའམ། དབུལ་པོའམ། རྒྱལ་པོ་ཐོབ་པའམ། ལྷའི་ལོངས་སྤྱོད་དང་། ལྷའི་གནས་སུམ་ཅུ་རྩ་གཉིས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། རྟག་ཏུ་དབང་ཕྱུག་ཆེན་པོར་འགྱུར་བ་དང་། ཀླུའི་སྐྱེ་གནས་དང་།
en: They will see whether their death and subsequent rebirth will be auspicious; whether they will be born into riches and power or into poverty; whether they will be born as a king or in any of the thirty-two abodes with their celestial enjoyments; whether they will be reborn as Śakra, Brahmā, Viṣṇu, or Maheśvara or as a nāga, preta, yakṣa, rākṣasa, or guhyaka.

source: ཡི་དགས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་གསང་བ་པ་རྣམས་ཀྱིས་དམྱལ་བ་མི་བཟད་པར་སྐྱེ་བ་དང་། མཚམས་མེད་པ་ལ་ཐུག་གི་བར་དུ་མཐོང་བ་དང་།
en: It will be fully revealed whether they are destined for a terrible rebirth in hell, including even the farthest reaches of the Avīci hell.

source: བྲམ་ཟེའི་རིགས་སམ། རྒྱལ་རིགས་སམ་གཞན་ཡང་རིགས་དུ་མ་སྣ་ཚོགས་པར་སྐྱེ་བར་མཐོང་བ་དག་འཇིག་རྟེན་མགོན་པོའི་མཐུས་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: They will clearly see, as if in front of their eyes, their rebirths in a family of brahmins or kṣatriyas, or in any other family.

source: །འཇིག་རྟེན་པའི་ལས་བསྒྲུབ་པར་བྱ་བ་དེ་དག་ཐམས་ཅད་བསྟན་པར་བྱ་སྟེ། རྒྱལ་བ་དང་། རྣམ་པར་རྒྱལ་བ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་།
en: Through the power of the Lord of the World, all the results of their worldly karma will appear to them clearly in a summary revelation. “

source: མི་ངས་དང་། ཡམས་ཀྱི་ནད་དང་། ཕ་རོལ་གྱི་འཁོར་རམ། རང་གི་འཁོར་ལ་གནོད་པ་དང་། དགྲ་དང་། ཕྱིར་རྒོལ་བ་དང་། འགྱེད་པ་དང་།
en: They will get a true picture of their minor and great victories and their prosperous existences, as well as times of plenty and times of famine, pestilence, misfortune, assault by foreign or domestic armies, and attack by opponents and adversaries.

source: གཡུལ་སྤྲོད་པ་དང་། ཚེ་རིང་བ་དང་། ཚེ་ཐུང་བ་དང་། ནད་འབྱུང་བ་དང་། ནད་མེད་པ་དང་།
en: They will see whether their lives will be long or short, whether they will be healthy or diseased.

source: ཆར་འབབ་པ་དང་། ཤིན་ཏུ་ཆར་འབབ་པ་དང་། ཆར་མི་འབབ་པ་དང་། དུས་མ་ཡིན་པར་འབབ་པ་དང་། དར་བ་དང་། རྒུད་པ་དང་། འབྱོར་པ་དང་། མི་འབྱོར་པ་དང་། འོང་བ་དང་། འགྲོ་བ་དང་། ནོར་དང་། འབྲུ་རྙེད་པ་དང་། འཕེལ་བ་དང་། འབྲི་བ་དང་།
en: They will see excessive rainfalls, droughts, untimely rains, their power and influence or lack thereof, their good or bad fortune, their acquisitions and losses, their obtainment of money and grain, the increases or decreases thereof, and any related famines.

source: ལོ་ཉེས་པ་མཐོང་བ་དང་། འཁོར་བ་ན་ད་ལྟར་གྱི་ལས་གང་ཅུང་ཟད་ལེགས་པར་བྱེད་པ་དང་། ཉེས་པར་བྱེད་པ་དང་། དགེ་བའམ། མི་དགེ་བའམ། འབྲི་བའམ། འཕེལ་བའམ།
en: They will see any saṃsāric karma that is unfolding for them, their good and bad deeds, their virtue and nonvirtue, and the fluctuations thereof.

source: སྐྱེ་བ་ལེགས་པར་སྐྱེ་བའམ། ངན་པར་སྐྱེ་བ་དང་། བུ་འབྱུང་བ། བུ་ཕོའམ། བུ་མོའམ། བུ་བཟང་པོའམ།
en: They will see auspicious and inauspicious births, whether they will obtain a son or a daughter, and whether a son will be good or bad, endowed with merit, or lacking it.

source: བུ་ངན་པའམ།
en: They will see him conceived in the womb.

source: བསོད་ནམས་ཅན་ནམ། བསོད་ནམས་མེད་པ་མངལ་ན་གནས་པ་དེ་དག་བདེན་པ་ཉིད་དུ་མཐོང་སྟེ། ལས་ཀྱི་ཆོ་ག་ལེགས་པར་བྱས་པས་ཐེ་ཚོམ་མི་བྱའོ།
en: If the rite is performed well, there is no doubt that they will truly see these facts. “

source: །ཚེས་གྲངས་དང་། རྒྱུ་སྐར་དང་། ཉིན་མཚན་བརྗོད་པར་བྱ་མི་དགོས་ཀྱི་བཟླས་བརྗོད་དང་།
en: When performing this rite, there are no restrictions regarding the lunar day or the nakṣatra, nor is it relevant whether it is day or night.

source: གཏོར་མ་དང་། གཙང་སྦྲ་དང་།
en: All that is required is mantra recitation and a bali offering.

source: བཀྲུ་བཤལ་དང་། ཤིན་ཏུ་ཁྲུས་བྱ་བ་དང་། གོས་གཙང་མ་བཅང་བ་དང་།
en: The vidyā holder should be ritually pure, thoroughly washed, and wear clean clothes.

source: བདེན་པར་སྨྲ་བ་དང་། བྱམས་པའི་སེམས་དང་། བླ་མ་ལ་ལེགས་པར་མཉན་པ་དེ་གཟུང་བ་ཁོ་ནར་བྱའོ། །ཟས་དང་། སྐོམ་གཙང་མ་དང་། ཆང་དང་།
en: He should speak the truth, cultivate loving thoughts, and obey his teacher.

source: ཤ་དང་། བེག་བཙོང་དང་། སྒོག་སྐྱ་དང་། ཀེའུ་དང་། འདྲེས་པར་བྱས་པའི་འདྲེས་པའི་ཟས་ཡོངས་སུ་སྤང་བ་དང་།
en: He should consume food and drink that is pure, and he should avoid defiled foods as well as alcohol, meat, foods that contain onions, garlic, red onions, and stale food.

source: ཤིན་ཏུ་སྤགས་པ་དང་། དེ་དག་ནི་ཁྱད་པར་འདོད་པས་ཡོངས་སུ་སྤང་བར་བྱས་ན་ལས་འདི་ནི་མོད་ལ་ཐམས་ཅད་མངོན་དུ་མཐོང་བར་འགྱུར་རོ།
en: In this way, the practitioner who seeks excellence will accomplish this rite and will see everything in front his eyes.

source: །དཀའ་ཐུབ་སྤྱོད་པ་ལ་བརྙས་སེམས་མི་བྱ། མ་གུས་པ་མི་བྱའི་ལྐོག་ཏུའང་མི་བྱའོ།
en: He should abide by his vows and should not disdain anyone or treat them disrespectfully, especially behind their back.

source: །རྗེས་སུ་བསྟན་པ་དེ་དག་ནི་མཆོག་ཡིན་ནོ། །བསྒྲུབ་པར་བྱ་བ་མཆོག་དེ་དག་ནི་འཇིག་རྟེན་དབང་ཕྱུག་མགོན་པོས་བཀའ་སྩལ་པ་ཡིན་ནོ།
en: This is the most important instruction, the supreme instruction given by the lokeśvara Lord himself. “

source: །དངུལ་ལས་མེ་ལོང་ཆུ་ཞེང་དུ་སོར་བཅུ་དྲུག་པ་བྱས་ལ་ཟངས་ལས་པདྨོའི་གདན་ཁྲུ་གང་གི་ཚད་སྡོང་བུ་དང་བཅས་པར་བྱའོ། །མེ་ལོང་གི་གོང་དུ་དངུལ་ལམ།
en: He should procure a silver mirror that is round in shape and sixteen fingers wide. It should be placed on a lotus base made of copper and then mounted on a stand that extends one cubit above the mirror.

source: གསེར་ལས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པ་བྱ་སྟེ་ཚད་སོར་བཞི་པ། གདན་པདྨོ་ཕྱག་བཞི་ལ་མདུང་རྩེག་སུམ་པ་དང་། ཞགས་པ་དང་། པདྨ་དང་། ནོར་བུའི་རིན་པོ་ཆེ་ཐོགས་པར་བྱ་བ་ནི་འཇོག་སྦྱོང་ལེགས་པར་བྱས་པ།
en: Using either silver or gold, he should make a figure of Noble Avalokiteśvara-Amoghapāśa that is four fingers tall and has four arms that hold a trident, noose, lotus, and jewel in their hands.

source: འཇམ་པོ་འོད་ཕྱིན་པ་ཙམ་དུ་སྦྱང་བར་བྱའོ།
en: The figure should be clean and polished to a shine.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་མེ་ལོང་གི་གོང་གི་འཇིག་རྟེན་དབང་ཕྱུག་གི་སྐུ་ལ་རིང་བསྲེལ་གཞག་པར་བྱའོ།
en: The vidyā holder should put relics inside it, place it upon the lotus seat, and offer camphor and musk to it.

source: །ག་པུར་དང་། གླ་རྩིས་སྐུ་ལ་མཆོད་པར་བྱའོ། །མེ་ལོང་གི་ཉེ་འཁོར་ཐོག་ཐག་ཏུ་དངུལ་གྱི་མེ་ཏོག་དང་། གསེར་གྱི་མེ་ཏོག་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཕྲེང་བ་གདགས་པར་བྱའོ།
en: He should place rows of silver and golden flowers inlaid with various jewels around the mirror. “

source: །དབང་བསྐུར་བའི་དར་གདགས་པར་བྱའོ། །དེ་ནས་རིག་སྔགས་འཆང་བས་མེ་ལོང་དེ་ལ་ཉི་མ་རེ་རེ་ཞིང་དུས་གསུམ་དུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ་སྟེ། ཇི་ཙམ་བརྒྱ་སྟོང་ཚང་གི་བར་དུ་བྱའོ།
en: He should then incant the mirror with the heart mantra of Amoghapāśa, reciting it one hundred and eight times every day at the three junctions of the day.

source: །ཁྲོ་བོའི་རྒྱལ་པོས་དབང་བསྐུར་བར་བྱའོ།
en: He should then consecrate the mirror with the mantra of Krodharāja.
